; domain
(define (domain housework)

    (:requirements :strips :typing :adl)

    ; Begin types
    (:types
        agent room item - object
        desk appliance - item
    )
    ; End types

    ; Begin predicates
    (:predicates
        (agent_at ?a - agent ?r - room)
        (agent_hand_free ?a - agent)
        (agent_has_item ?a - agent ?i - item)

        (item_at ?i - item ?r - room)
        (item_on ?i - item ?d - desk)
        (item_in ?i - item ?ap - appliance) 

        (item_accessible ?i - item)
        (item_pickable ?i - item)

        (appliance_on ?ap - appliance)
        (appliance_at ?ap - appliance ?r - room)

        (neighbor ?r1 - room ?r2 - room)

        (cooked ?i - item)
        (boiled ?i - item)
        (heated ?i - item)

        (is_bread ?i - item)
        (is_toaster ?ap - appliance)
        (is_kettle ?i - item)
        (is_stove ?ap - appliance)
        (is_cup_ramen ?i - item)
        (is_water_dispenser ?ap - appliance)
        (is_desk ?d - desk)
        (is_microwave ?ap - appliance)
    )
    ; End predicates

    ; Begin actions
    (:action goto
        :parameters (?a - agent ?from - room ?to - room)
        :precondition (and
            (agent_at ?a ?from)
            (neighbor ?from ?to)
        )
        :effect (and
            (not (agent_at ?a ?from))
            (agent_at ?a ?to)
        )
    )

    (:action pick_from_room
        :parameters (?a - agent ?i - item ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_at ?i ?r)
            (item_accessible ?i)
            (item_pickable ?i)
            (agent_hand_free ?a)
        )
        :effect (and
            (not (item_at ?i ?r))
            (not (agent_hand_free ?a))
            (agent_has_item ?a ?i)
        )
    )

    (:action pick_from_appliance
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (agent_hand_free ?a)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (item_accessible ?i)
            (item_pickable ?i)
        )
        :effect (and
            (not (item_in ?i ?ap))
            (not (agent_hand_free ?a))
            (agent_has_item ?a ?i)
        )
    )

    (:action place_on_desk
        :parameters (?a - agent ?i - item ?d - desk ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (not (item_on ?i ?d))
            (agent_has_item ?a ?i)
        )
        :effect (and
            (not (agent_has_item ?a ?i))
            (agent_hand_free ?a)
            (item_on ?i ?d)
        )
    )
    
    (:action place_in_appliance
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (not (item_in ?i ?ap))
            (appliance_at ?ap ?r)
            (agent_has_item ?a ?i)
        )
        :effect (and
            (not (agent_has_item ?a ?i))
            (agent_hand_free ?a)
            (item_in ?i ?ap)
        )
    )

    (:action turn_on_appliance
        :parameters (?a - agent ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (appliance_at ?ap ?r)
            (not (appliance_on ?ap))
        )
        :effect (and
            (appliance_on ?ap)
        )
    )

    (:action turn_off_appliance
        :parameters (?a - agent ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (appliance_at ?ap ?r)
            (appliance_on ?ap)
        )
        :effect (and
            (not (appliance_on ?ap))
        )
    )

    (:action wait_heat_food
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (is_microwave ?ap)
            (appliance_on ?ap)
            (not (heated ?i))
        )
        :effect (and
            (heated ?i)
        )
    )
    ; End actions
)

; problem
(define (problem singledeskroom_housework)
    (:domain housework)

    ; Begin objects
    (:objects
        robot - agent
        singledeskroom - room
        food water_bottle eggs - item
        microwave egg_container - appliance
        singledesk - desk
    )

    ; Begin init
    (:init
        ; Connections
        ; (No neighbors in this scene graph)

        ; Positions
        (agent_at robot singledeskroom)
        (agent_hand_free robot)
        (item_at food singledeskroom)
        (item_at water_bottle singledeskroom)
        (item_at eggs singledeskroom)
        (item_at singledesk singledeskroom)
        (appliance_at microwave singledeskroom)
        (appliance_at egg_container singledeskroom)

        ; Attributes
        (item_accessible food)
        (item_pickable food)
        (item_accessible microwave)
        (item_accessible water_bottle)
        (item_pickable water_bottle)
        (item_accessible eggs)
        (item_pickable eggs)
        (item_accessible egg_container)
        (item_accessible singledesk)

        (is_microwave microwave)
        (is_desk singledesk)
    )
    ; End init

    ; Begin goal
    (:goal (and
        (heated food)
        (item_on food singledesk)
        (item_on water_bottle singledesk)
        (item_in eggs egg_container)
    ))
    ; End goal
)

; plan
1. (turn_on_appliance robot microwave singledeskroom)
   added: (appliance_on microwave)
   goals met: 0 of 4
2. (pick_from_room robot eggs singledeskroom)
   deleted: (item_at eggs singledeskroom) (agent_hand_free robot)
   added: (agent_has_item robot eggs)
   goals met: 0 of 4
3. (place_in_appliance robot eggs egg_container singledeskroom)
   deleted: (agent_has_item robot eggs)
   added: (agent_hand_free robot) (item_in eggs egg_container)
   goals met: 1 of 4
4. (pick_from_room robot water_bottle singledeskroom)
   deleted: (item_at water_bottle singledeskroom) (agent_hand_free robot)
   added: (agent_has_item robot water_bottle)
   goals met: 1 of 4
5. (place_on_desk robot water_bottle singledesk singledeskroom)
   deleted: (agent_has_item robot water_bottle)
   added: (agent_hand_free robot) (item_on water_bottle singledesk)
   goals met: 2 of 4
6. (pick_from_room robot food singledeskroom)
   deleted: (item_at food singledeskroom) (agent_hand_free robot)
   added: (agent_has_item robot food)
   goals met: 2 of 4
7. (place_in_appliance robot food microwave singledeskroom)
   deleted: (agent_has_item robot food)
   added: (agent_hand_free robot) (item_in food microwave)
   goals met: 2 of 4
8. (wait_heat_food robot food microwave singledeskroom)
   added: (heated food)
   goals met: 3 of 4
9. (pick_from_appliance robot food microwave singledeskroom)
   deleted: (item_in food microwave) (agent_hand_free robot)
   added: (agent_has_item robot food)
   goals met: 3 of 4
10. (place_on_desk robot food singledesk singledeskroom)
   deleted: (agent_has_item robot food)
   added: (agent_hand_free robot) (item_on food singledesk)
   goals met: 4 of 4
